import Mock from 'mockjs';
Mock.mock("/list",{
    'result':[
        {
            url:"http://img1.imgtn.bdimg.com/it/u=1515615306,1304926477&fm=26&gp=0.jpg",
        },
        {
            url:"http://img3.imgtn.bdimg.com/it/u=3754952062,1995030549&fm=26&gp=0.jpg",
        },
        {
            url:"http://img4.imgtn.bdimg.com/it/u=201042278,1380145310&fm=26&gp=0.jpg",
        },
    
    ],

    'newslist':[
        {
            id: 1,
            title: "摸摸头",
            add_time: "2016-12-12 12:12:12",
            click: 1,
            url: "https://ss2.bdstatic.com/70cFvnSh_Q1YnxGkpoWK1HF6hhy/it/u=2585338183,1939979243&fm=26&gp=0.jpg",
            newsinfo: 
            {
                    content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
                }
        },
        {
            id: 2,
            title: "快点理我",
            add_time: "2016-12-12 12:12:12",
            click: 0,
            url: "https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=2550077185,2777480689&fm=26&gp=0.jpg",
            newsinfo: 
                {
                    content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
                }
        },
        {
            id: 3,
            title: "我起床啦",
            add_time: "2016-12-12 12:12:12",
            click: 1,
            url: "https://ss1.bdstatic.com/70cFvXSh_Q1YnxGkpoWK1HF6hhy/it/u=2917780238,2910377115&fm=26&gp=0.jpg",
            newsinfo: 
                {
                    content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
                }
        },
        {
            id: 4,
            title: "要抱抱",
            add_time: "2016-12-12 12:12:12",
            click: 22,
            url: "https://ss2.bdstatic.com/70cFvnSh_Q1YnxGkpoWK1HF6hhy/it/u=3804864461,4234849891&fm=26&gp=0.jpg",
            newsinfo: 
                {
                    content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
                }
        },
        {
            id: 5,
            title: "晚安",
            add_time: "2016-12-12 12:12:12",
            click: 2,
            url: "https://ss0.bdstatic.com/70cFvHSh_Q1YnxGkpoWK1HF6hhy/it/u=306027709,553203419&fm=26&gp=0.jpg",
            newsinfo: 
                {
                    content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
                }
        },
        {
            id: 6,
            title: "超凶",
            add_time: "2016-12-12 12:12:12",
            click: 6,
            url: "https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=2986097442,4089136424&fm=26&gp=0.jpg",
            newsinfo: 
                {
                    content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
                }
        },
        {
            id: 7,
            title: "生气",
            add_time: "2016-12-12 12:12:12",
            click: 0,
            url: "https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=1680884175,163636088&fm=26&gp=0.jpg",
            newsinfo: 
                {
                    content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
                }
        },
        {
            id: 8,
            title: "你走吧",
            add_time: "2016-12-12 12:12:12",
            click: 0,
            url: "https://ss0.bdstatic.com/70cFvHSh_Q1YnxGkpoWK1HF6hhy/it/u=1682289245,1037026507&fm=26&gp=0.jpg",
            newsinfo: 
                {
                    content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
                }
        },
        {
            id: 9,
            title: "嘤嘤嘤",
            add_time: "2016-12-12 12:12:12",
            click: 0,
            url: "https://ss3.bdstatic.com/70cFv8Sh_Q1YnxGkpoWK1HF6hhy/it/u=2073060379,116453462&fm=26&gp=0.jpg",
            newsinfo: 
                {
                    content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
                }
        },
        {
            id: 10,
            title: "超乖",
            add_time: "2016-12-12 12:12:12",
            click: 0,
            url: "https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=2791055063,520076706&fm=26&gp=0.jpg",
            newsinfo: 
                {
                    content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
                }
        },
    ],

    'newsinfo': [
        {
            id: 1,
            title: "摸摸头",
            add_time: "2016-12-12 12:12:12",
            click: 0,
            content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
        },

        {
            id: 2,
            title: "超乖",
            add_time: "2016-12-12 12:12:12",
            click: 0,
            content: "猫行动敏捷，善跳跃。吃鱼，鼠，兔等。猫之所以喜爱吃鱼和老鼠，是因为猫是夜行动物，为了在夜间能看清事物，需要大量的牛磺酸，而老鼠和鱼的体内就含牛磺酸，所以猫不仅仅是因为喜欢吃鱼和老鼠，也是因为自己的需要才吃。猫作为鼠类的天敌，可以有效减少鼠类对青苗等作物的损害，由猫的字形“苗”可见中国古代农业生活之。猫能在高墙上若无其事地散步，轻盈跳跃，不禁折服于它的平衡感。这主要得益于猫的出类拔萃的反应神经和平衡感。它只需轻微地改变尾巴的位置和高度就可取得身体的平衡，再利用后脚强健的肌肉和结实的关节就可敏捷地跳跃，即使在高空中落下也可在空中改变身体姿势，轻盈准确地落地。善于爬高，但却不善于从顶点下落。即使从高处掉下或者跳下来的时候，猫靠尾巴调整平衡，使带软垫的四肢着地。注意不要拽断猫的尾巴，会影响它的平衡能力，也会容易使猫腹泻，减短猫的寿命。"
        },
    ]
});
export default Mock;